/* -*- coding: utf-8; tab-width: 4 -*- */
/**
 * @file	q_114.cpp
 * @brief	プログラミングコンテストのためのアルゴリズムとデータ構造p.114の問題の回答
 * @author	Yasutaka SHINDOH / 新堂 安孝
 * @note	see http://www.amazon.co.jp/dp/4839952957 .
 */

/*
  問題:
  地域の治水対策として、洪水の被害状況をシミュレーションで仮想してみよう。
  図のように 1×1 (m^2) の区画からなる格子上に表された地域の模式断面図が与えられるので、
  地域にできる各水たまりの面積を報告してください。

  与えられた地域に対して限りなく雨が降り、
  地域から溢れ出た水は左右の海に流れ出ると仮定します。
  例えば、図の断面積では、左から面積が4, 2, 1, 19 の水たまりができます。
 */

/*
  メモ:
  自力ではきれいな解き方ができなかった。
 */

int
main()
{


	return 0;
}
